/*
Вы уже немало знаете о Java и совсем скоро начнёте работать самостоятельно. Потренируйтесь это делать.
Напишите от начала и до конца код небольшого приложения для маркетингового отдела зоопарка. Оно должно печатать
список и количество животных, кормления которых смогут увидеть посетители, а также расписание сеансов.
Добавьте в список шиншиллу, крокодила, льва, медведя и слона — строго в таком порядке. При составлении расписания
учитывайте, что первым кормят крокодила, затем слона, ещё через час — шиншиллу, в полдень — льва, а последним — медведя.
Для печати животных используйте сокращённый цикл for. Весь необходимый текст вы найдёте в комментариях — от вас нужен только код.
 */
public class Main {
    public static void main(String[] args) {
        // "Сегодня в зоопарке можно увидеть кормления " + ... + " животных:"
        // "Это будут:"
        // "Шиншилла"
        // "Крокодил"
        // "Лев"
        // "Медведь"
        // "Слон"
        // "Расписание кормлений:"
        // "В 9:00 - "
        // "В 10:00 - "
        // "В 11:00 - "
        // "В 12:00 - "
        // "В 13:00 - "
    }
}